# Relatório de análise I

## Importando a base de dados

In [1]:
import pandas as pd

In [4]:
dados = pd.read_csv('aluguel.csv', sep=';')

In [7]:
type(dados)

pandas.core.frame.DataFrame

In [9]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

# Informações Gerais sobre a Base de Dados

In [10]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [17]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns=['Tipo de dados'])

In [19]:
tipos_de_dados.columns.name = 'Variáveis'

In [20]:
tipos_de_dados

Variáveis  Tipo de dados
Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64

In [22]:
dados.shape[0]

32960

In [23]:
dados.shape[1]

9

In [25]:
print(f'A base de dados apresenta {dados.shape[0]} registros (imóveis) e {dados.shape[1]} variáveis ')

A base de dados apresenta 32960 registros (imóveis) e 9 variáveis